# 3 SQL Magic Extension

Tutorial Reference : https://www.datacamp.com/community/tutorials/sql-interface-within-jupyterlab

**Magic commands** are a set of convenient functions in Jupyter Notebooks that are designed to solve some of the common problems in standard data analysis. You can see all of the available magics with the help of `%lsmagic`.

In [ ]:
%lsmagic

<br>

[IPython SQL magic extension](https://github.com/catherinedevlin/ipython-sql) created by Catheride Devlin makes it possible to write SQL queries directly into code cells as well as read the results straight into pandas DataFrames ([Source](http://datascience.sharerecipe.net/2019/01/11/unleash-the-power-of-jupyter-notebooks/)). This works for both the traditional notebooks as well as the modern Jupyter Labs.

**`Installing SQL module in the notebook`**

```
!pip install ipython-sql
```

In [ ]:
# Uncomment below if you haven't install the ipython-sql
# !pip install ipython-sql

<br>

## Loading the SQL module
By using `%load_ext sql`, we can use the `%sql` magic comand inside our jupyter files

In [3]:
%load_ext sql

<br>

## Connecting to Database
The SQL Magic command is based on [SQL ALchemy](https://www.sqlalchemy.org/) standard. Basically it can connect to many type of database, but since we focusing on **SQLite**, we connect to our SQLite database by put `sqlite:///` and specifying the file location.

In [4]:
#Specifying the path of the database  
%sql sqlite:///database/chinook.db

'Connected: @database/chinook.db'

<br>

Database used is `chinook` database, view the detail here: https://www.sqlitetutorial.net/sqlite-sample-database/

<img src="database/chinook_schema.png" width="800">

## Query Database using **`%sql`** Magic command

In [5]:
# Show All table from `chinook` database
%sql SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%'

 * sqlite:///database/chinook.db
Done.

[('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',)]

<br>

As you can see, by using **`%sql`** magic command, we can directly query to the database without creating _cursor connection_. <br> the result of query also showing up as **HTML Table Format**, which is pretty neat.

### One Liner Query
As Mentioned previously there are 2 component when querying databaset using SQL Magic extension, <br>
The **`%sql`** + **Table Query** <br>
Those 2 has to be in the same line

In [6]:
%sql SELECT * FROM employees LIMIT 3

 * sqlite:///database/chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com')]

<br><br>

### Multiline Query
If you have **Long and/or Complex Query**, consider using multiline to increase readability of the query. <br>
By using _double percentage_ **`%%sql`**, you can use the whole cell into the query command.

In [7]:
%%sql

SELECT genres.Name AS 'Genre Name', COUNT(DISTINCT artists.Name) AS 'Total Artist',
COUNT(DISTINCT albums.Title) AS 'Total Album', COUNT(DISTINCT tracks.Name) AS 'Total Track'
FROM tracks
INNER JOIN genres ON genres.GenreId = tracks.GenreId
INNER JOIN albums ON albums.AlbumId = tracks.AlbumId
INNER JOIN artists ON albums.ArtistId = artists.ArtistId
GROUP BY genres.Name
ORDER BY COUNT(DISTINCT artists.Name) DESC

 * sqlite:///database/chinook.db
Done.

[('Classical', 66, 72, 74),
 ('Rock', 51, 117, 1213),
 ('Latin', 28, 39, 557),
 ('Alternative & Punk', 16, 23, 324),
 ('Metal', 14, 35, 343),
 ('Jazz', 10, 13, 129),
 ('TV Shows', 5, 10, 93),
 ('Blues', 5, 7, 78),
 ('Alternative', 5, 5, 40),
 ('Soundtrack', 4, 4, 43),
 ('R&B/Soul', 4, 4, 61),
 ('World', 3, 3, 28),
 ('Reggae', 3, 4, 49),
 ('Pop', 3, 3, 46),
 ('Electronica/Dance', 3, 3, 30),
 ('Sci Fi & Fantasy', 2, 2, 26),
 ('Hip Hop/Rap', 2, 2, 35),
 ('Drama', 2, 4, 62),
 ('Science Fiction', 1, 2, 13),
 ('Rock And Roll', 1, 1, 12),
 ('Opera', 1, 1, 1),
 ('Heavy Metal', 1, 3, 27),
 ('Easy Listening', 1, 1, 24),
 ('Comedy', 1, 1, 17),
 ('Bossa Nova', 1, 1, 15)]

<br><br>

## DataFrame Output

You can also get the result of your SQL query as a pandas data frame object if you would like to proceed working with the result set using Python. The result object of SQL query execution can be accessed from a variable _. This is because IPython's output caching system defines several global variables; _ (a single underscore) stores previous output just like the IPython interpreter.

In [8]:
df = _.DataFrame()
df.head()

           Genre Name  Total Artist  Total Album  Total Track
0           Classical            66           72           74
1                Rock            51          117         1213
2               Latin            28           39          557
3  Alternative & Punk            16           23          324
4               Metal            14           35          343